In [1]:
import pandas as p

In [2]:
d=p.read_csv("names.csv")

In [3]:
d

   S.No       Name  Percentage
0     1     sivant          10
1     3       king          30
2     2      starr          20
3     4     cashew          40
4     5  scientist          50
5     6       siva          60
6     7       yogi          70
7     8    mandela          80

In [4]:
d.max()

S.No             8
Name          yogi
Percentage      80
dtype: object

In [5]:
d.min()

S.No               1
Name          cashew
Percentage        10
dtype: object

In [6]:
d.mean()

S.No           4.5
Percentage    45.0
dtype: float64

In [7]:
d.columns

Index(['S.No', 'Name', 'Percentage'], dtype='object')

In [8]:
d.sort_values("Percentage")

   S.No       Name  Percentage
0     1     sivant          10
2     2      starr          20
1     3       king          30
3     4     cashew          40
4     5  scientist          50
5     6       siva          60
6     7       yogi          70
7     8    mandela          80

In [9]:
d.describe()

          S.No  Percentage
count  8.00000    8.000000
mean   4.50000   45.000000
std    2.44949   24.494897
min    1.00000   10.000000
25%    2.75000   27.500000
50%    4.50000   45.000000
75%    6.25000   62.500000
max    8.00000   80.000000

In [10]:
d.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 3 columns):
S.No          8 non-null int64
Name          8 non-null object
Percentage    8 non-null int64
dtypes: int64(2), object(1)
memory usage: 272.0+ bytes

In [11]:
d.head(4)

   S.No    Name  Percentage
0     1  sivant          10
1     3    king          30
2     2   starr          20
3     4  cashew          40

In [12]:
d.tail(2)

   S.No     Name  Percentage
6     7     yogi          70
7     8  mandela          80

In [13]:
d.loc[d["Percentage"]%20==0]

   S.No     Name  Percentage
2     2    starr          20
3     4   cashew          40
5     6     siva          60
7     8  mandela          80

In [16]:
ds=p.DataFrame(d)

In [17]:
ds

   S.No       Name  Percentage
0     1     sivant          10
1     3       king          30
2     2      starr          20
3     4     cashew          40
4     5  scientist          50
5     6       siva          60
6     7       yogi          70
7     8    mandela          80

In [18]:
print(ds["Name"])

0       sivant
1         king
2        starr
3       cashew
4    scientist
5         siva
6         yogi
7      mandela
Name: Name, dtype: object

In [19]:
ds=ds.drop(6)

In [20]:
ds

   S.No       Name  Percentage
0     1     sivant          10
1     3       king          30
2     2      starr          20
3     4     cashew          40
4     5  scientist          50
5     6       siva          60
7     8    mandela          80

In [21]:
ds["Percentage"][4]=100

C:\Users\Sivant\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  """Entry point for launching an IPython kernel.

In [22]:
ds

   S.No       Name  Percentage
0     1     sivant          10
1     3       king          30
2     2      starr          20
3     4     cashew          40
4     5  scientist         100
5     6       siva          60
7     8    mandela          80

In [23]:
j=0;
for i in ds["Name"]:
    if i=="sivant":
        ds["Percentage"][j]*=10
    j+=1
print(ds)

   S.No       Name  Percentage
0     1     sivant         100
1     3       king          30
2     2      starr          20
3     4     cashew          40
4     5  scientist         100
5     6       siva          60
7     8    mandela          80

C:\Users\Sivant\Anaconda3\lib\site-packages\ipykernel_launcher.py:4: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  after removing the cwd from sys.path.